# CapsLock

## Description
CapsLock returns TRUE if the Caps Lock was depressed during the last user event. This function operates with the MouseDown, KeyDown, AutoKey, GetPt, GetPtL, GetLine, and GetRect calls.

```pascal
FUNCTION CapsLock : BOOLEAN;
```

```python
def vs.CapsLock():
    return BOOLEAN
```

## Version
Availability: from All Versions

## Category
* User Interactive